Revit 2027 API
FamilySymbol.Family Property
 The Family object to which the symbol belongs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Family Family { get; }
Public ReadOnly Property Family As Family
	Get
public:
property Family^ Family {
	Family^ get ();
}
member Family : Family with get
Property Value
Family
See Also
Reference
FamilySymbol Class
Autodesk.Revit.DB Namespace